tap 'nicoverbruggen/homebrew-cask'

brew 'zsh-syntax-highlighting'
brew 'asdf'

# tools
cask 'logitech-options'

# apps
cask 'spotify'
cask 'google-chrome'

# develop
cask 'iterm2'
cask 'hyper'

cask 'visual-studio-code'
cask 'webstorm'
cask 'pycharm-ce'
cask 'dbeaver-community'
cask 'arduino-ide'

cask 'commander-one'

cask 'fork'
cask 'docker'
cask 'docker-desktop'

brew 'wget'
brew 'curl'
brew 'nmap'
brew 'htop'
brew 'coreutils'    # Those that come with macOS are outdated


# Mac App Store
brew 'mas'                              # Mac App Store manager
mas "ColorSlurp", id: 1287239339







# Obsole: refactored, no longer needed, replaced with asdf, ...
# brew 'composer'    # Not needed when installing herd (herd = php, composer, laravel)
# cask 'phpstorm'
# cask 'phpmon'
# cask 'dbngin'
# cask 'sequel-ace'
# cask 'steam'
# cask 'tableplus'
# brew 'python3'
# brew 'node'  # trying to use asdf instead for nodejs

# raycast
#cask 'raycast'