tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'


brew 'coreutils'    # Those that come with macOS are outdated
brew 'node'

cask 'logitech-options'
cask 'fork'
cask 'hyper'
brew 'composer'    # Not needed when installing herd (herd = php, composer, laravel)
cask 'phpstorm'
cask 'phpmon'
cask 'dbngin'
cask 'sequel-ace'
cask 'spotify'
cask 'google-chrome'
cask 'iterm2'
cask 'visual-studio-code'
cask 'arduino-ide'
cask 'steam'
cask 'tableplus'
#cask 'commander-one'

brew 'python3'

# Mac App Store
brew 'mas'                              # Mac App Store manager
mas "ColorSlurp", id: 1287239339

# raycast
cask 'raycast'